In [1]:
import numpy as np
import pandas as pd

In [6]:
pd.read_csv?

In [7]:
employee_skills_df = pd.read_csv('Employee_skills_traits.csv')

##  Perform exploratory data analysis

In [8]:
employee_skills_df.head()

,ID,Employment period,Time in current department,Gender,Team leader,Age,Member of professional organizations,.Net,SQL Server,HTML CSS Java Script,PHP mySQL,Fast working,Awards,Communicative
0,6723,5,4,0,1,48,1,1,1,0,1,1,0,1
1,8923,5,3,1,1,26,1,1,0,0,1,1,0,0
2,2322,11,8,0,0,34,0,0,1,1,0,1,0,1
3,235,7,5,1,1,27,1,0,1,0,1,1,1,0
4,9523,18,8,0,0,38,0,0,0,1,1,1,1,1

In [4]:
type(employee_skills_df)

pandas.core.frame.DataFrame

In [9]:
employee_skills_df.tail()

,ID,Employment period,Time in current department,Gender,Team leader,Age,Member of professional organizations,.Net,SQL Server,HTML CSS Java Script,PHP mySQL,Fast working,Awards,Communicative
993,6098,12,3,1,1,32,1,0,0,0,1,1,0,1
994,12133,16,8,1,0,36,1,1,1,0,0,0,1,1
995,854,11,4,0,1,34,1,0,1,0,1,1,0,0
996,13444,8,8,1,0,36,0,0,1,0,0,0,1,1
997,17170,16,6,1,1,44,0,1,0,1,1,1,0,0

In [10]:
employee_skills_df.columns

Index(['ID', 'Employment period ', 'Time in current department ', 'Gender ',
       'Team leader ', 'Age ', 'Member of professional organizations ',
       '.Net ', 'SQL Server ', 'HTML CSS Java Script ', 'PHP mySQL ',
       'Fast working', 'Awards', 'Communicative '],
      dtype='object')

In [11]:
employee_skills_df.shape

(998, 14)

In [12]:
employee_skills_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 998 entries, 0 to 997
Data columns (total 14 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   ID                                     998 non-null    int64
 1   Employment period                      998 non-null    int64
 2   Time in current department             998 non-null    int64
 3   Gender                                 998 non-null    int64
 4   Team leader                            998 non-null    int64
 5   Age                                    998 non-null    int64
 6   Member of professional organizations   998 non-null    int64
 7   .Net                                   998 non-null    int64
 8   SQL Server                             998 non-null    int64
 9   HTML CSS Java Script                   998 non-null    int64
 10  PHP mySQL                              998 non-null    int64
 11  Fast working                           998 non-null    int64
 12  Awards                                 998 non-null    int64
 13  Communicative                          998 non-null    int64
dtypes: int64(14)
memory usage: 109.3 KB

In [13]:
employee_skills_df[25:30]

,ID,Employment period,Time in current department,Gender,Team leader,Age,Member of professional organizations,.Net,SQL Server,HTML CSS Java Script,PHP mySQL,Fast working,Awards,Communicative
25,13993,14,10,0,0,44,1,0,0,0,1,0,0,1
26,5487,8,8,0,1,39,1,0,0,1,0,1,0,1
27,16157,6,3,0,0,42,1,0,1,1,0,0,0,1
28,12867,10,6,0,1,55,0,0,1,0,0,1,0,0
29,1063,3,2,1,1,37,0,0,0,0,0,0,0,0

### average and median of employment period

### average and median of age

### average of time in current department

### No. of records for male and female

No. of records for each skill

### Visualisatio of time period vs team leader

### Visualisation of employment period vs team leader

### Visualisation of age vs team leader

### Visualisatiion of gender vs team leader